espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp2hp_peri_pms_reg.h
/** PMS_LP_MM_PMS_REG2_REG register
 *  Permission control register2 for the LP CPU in machine mode
 */
#define PMS_LP_MM_PMS_REG2_REG (DR_REG_LP2HP_PERI_PMS_BASE + 0xa4)
/** PMS_LP_MM_HP_MCPWM0_ALLOW : R/W; bitpos: [0]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP MCPWM0.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_MCPWM0_ALLOW    (BIT(0))
#define PMS_LP_MM_HP_MCPWM0_ALLOW_M  (PMS_LP_MM_HP_MCPWM0_ALLOW_V << PMS_LP_MM_HP_MCPWM0_ALLOW_S)
#define PMS_LP_MM_HP_MCPWM0_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_MCPWM0_ALLOW_S  0
/** PMS_LP_MM_HP_MCPWM1_ALLOW : R/W; bitpos: [1]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP MCPWM1.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_MCPWM1_ALLOW    (BIT(1))
#define PMS_LP_MM_HP_MCPWM1_ALLOW_M  (PMS_LP_MM_HP_MCPWM1_ALLOW_V << PMS_LP_MM_HP_MCPWM1_ALLOW_S)
#define PMS_LP_MM_HP_MCPWM1_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_MCPWM1_ALLOW_S  1
/** PMS_LP_MM_HP_TIMER_GROUP0_ALLOW : R/W; bitpos: [2]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP timer
 *  group0.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_TIMER_GROUP0_ALLOW    (BIT(2))
#define PMS_LP_MM_HP_TIMER_GROUP0_ALLOW_M  (PMS_LP_MM_HP_TIMER_GROUP0_ALLOW_V << PMS_LP_MM_HP_TIMER_GROUP0_ALLOW_S)
#define PMS_LP_MM_HP_TIMER_GROUP0_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_TIMER_GROUP0_ALLOW_S  2
/** PMS_LP_MM_HP_TIMER_GROUP1_ALLOW : R/W; bitpos: [3]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP timer
 *  group1.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_TIMER_GROUP1_ALLOW    (BIT(3))
#define PMS_LP_MM_HP_TIMER_GROUP1_ALLOW_M  (PMS_LP_MM_HP_TIMER_GROUP1_ALLOW_V << PMS_LP_MM_HP_TIMER_GROUP1_ALLOW_S)
#define PMS_LP_MM_HP_TIMER_GROUP1_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_TIMER_GROUP1_ALLOW_S  3
/** PMS_LP_MM_HP_I2C0_ALLOW : R/W; bitpos: [4]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP I2C0.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_I2C0_ALLOW    (BIT(4))
#define PMS_LP_MM_HP_I2C0_ALLOW_M  (PMS_LP_MM_HP_I2C0_ALLOW_V << PMS_LP_MM_HP_I2C0_ALLOW_S)
#define PMS_LP_MM_HP_I2C0_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_I2C0_ALLOW_S  4
/** PMS_LP_MM_HP_I2C1_ALLOW : R/W; bitpos: [5]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP I2C1.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_I2C1_ALLOW    (BIT(5))
#define PMS_LP_MM_HP_I2C1_ALLOW_M  (PMS_LP_MM_HP_I2C1_ALLOW_V << PMS_LP_MM_HP_I2C1_ALLOW_S)
#define PMS_LP_MM_HP_I2C1_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_I2C1_ALLOW_S  5
/** PMS_LP_MM_HP_I2S0_ALLOW : R/W; bitpos: [6]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP I2S0.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_I2S0_ALLOW    (BIT(6))
#define PMS_LP_MM_HP_I2S0_ALLOW_M  (PMS_LP_MM_HP_I2S0_ALLOW_V << PMS_LP_MM_HP_I2S0_ALLOW_S)
#define PMS_LP_MM_HP_I2S0_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_I2S0_ALLOW_S  6
/** PMS_LP_MM_HP_I2S1_ALLOW : R/W; bitpos: [7]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP I2S1.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_I2S1_ALLOW    (BIT(7))
#define PMS_LP_MM_HP_I2S1_ALLOW_M  (PMS_LP_MM_HP_I2S1_ALLOW_V << PMS_LP_MM_HP_I2S1_ALLOW_S)
#define PMS_LP_MM_HP_I2S1_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_I2S1_ALLOW_S  7
/** PMS_LP_MM_HP_I2S2_ALLOW : R/W; bitpos: [8]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP I2S2.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_I2S2_ALLOW    (BIT(8))
#define PMS_LP_MM_HP_I2S2_ALLOW_M  (PMS_LP_MM_HP_I2S2_ALLOW_V << PMS_LP_MM_HP_I2S2_ALLOW_S)
#define PMS_LP_MM_HP_I2S2_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_I2S2_ALLOW_S  8
/** PMS_LP_MM_HP_PCNT_ALLOW : R/W; bitpos: [9]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP PCNT.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_PCNT_ALLOW    (BIT(9))
#define PMS_LP_MM_HP_PCNT_ALLOW_M  (PMS_LP_MM_HP_PCNT_ALLOW_V << PMS_LP_MM_HP_PCNT_ALLOW_S)
#define PMS_LP_MM_HP_PCNT_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_PCNT_ALLOW_S  9
/** PMS_LP_MM_HP_UART0_ALLOW : R/W; bitpos: [10]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP UART0.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_UART0_ALLOW    (BIT(10))
#define PMS_LP_MM_HP_UART0_ALLOW_M  (PMS_LP_MM_HP_UART0_ALLOW_V << PMS_LP_MM_HP_UART0_ALLOW_S)
#define PMS_LP_MM_HP_UART0_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_UART0_ALLOW_S  10
/** PMS_LP_MM_HP_UART1_ALLOW : R/W; bitpos: [11]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP UART1.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_UART1_ALLOW    (BIT(11))
#define PMS_LP_MM_HP_UART1_ALLOW_M  (PMS_LP_MM_HP_UART1_ALLOW_V << PMS_LP_MM_HP_UART1_ALLOW_S)
#define PMS_LP_MM_HP_UART1_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_UART1_ALLOW_S  11
/** PMS_LP_MM_HP_UART2_ALLOW : R/W; bitpos: [12]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP UART2.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_UART2_ALLOW    (BIT(12))
#define PMS_LP_MM_HP_UART2_ALLOW_M  (PMS_LP_MM_HP_UART2_ALLOW_V << PMS_LP_MM_HP_UART2_ALLOW_S)
#define PMS_LP_MM_HP_UART2_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_UART2_ALLOW_S  12
/** PMS_LP_MM_HP_UART3_ALLOW : R/W; bitpos: [13]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP UART3.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_UART3_ALLOW    (BIT(13))
#define PMS_LP_MM_HP_UART3_ALLOW_M  (PMS_LP_MM_HP_UART3_ALLOW_V << PMS_LP_MM_HP_UART3_ALLOW_S)
#define PMS_LP_MM_HP_UART3_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_UART3_ALLOW_S  13
/** PMS_LP_MM_HP_UART4_ALLOW : R/W; bitpos: [14]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP UART4.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_UART4_ALLOW    (BIT(14))
#define PMS_LP_MM_HP_UART4_ALLOW_M  (PMS_LP_MM_HP_UART4_ALLOW_V << PMS_LP_MM_HP_UART4_ALLOW_S)
#define PMS_LP_MM_HP_UART4_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_UART4_ALLOW_S  14
/** PMS_LP_MM_HP_PARLIO_ALLOW : R/W; bitpos: [15]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP PARLIO.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_PARLIO_ALLOW    (BIT(15))
#define PMS_LP_MM_HP_PARLIO_ALLOW_M  (PMS_LP_MM_HP_PARLIO_ALLOW_V << PMS_LP_MM_HP_PARLIO_ALLOW_S)
#define PMS_LP_MM_HP_PARLIO_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_PARLIO_ALLOW_S  15
/** PMS_LP_MM_HP_GPSPI2_ALLOW : R/W; bitpos: [16]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP GP-SPI2.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_GPSPI2_ALLOW    (BIT(16))
#define PMS_LP_MM_HP_GPSPI2_ALLOW_M  (PMS_LP_MM_HP_GPSPI2_ALLOW_V << PMS_LP_MM_HP_GPSPI2_ALLOW_S)
#define PMS_LP_MM_HP_GPSPI2_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_GPSPI2_ALLOW_S  16
/** PMS_LP_MM_HP_GPSPI3_ALLOW : R/W; bitpos: [17]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP GP-SPI3.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_GPSPI3_ALLOW    (BIT(17))
#define PMS_LP_MM_HP_GPSPI3_ALLOW_M  (PMS_LP_MM_HP_GPSPI3_ALLOW_V << PMS_LP_MM_HP_GPSPI3_ALLOW_S)
#define PMS_LP_MM_HP_GPSPI3_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_GPSPI3_ALLOW_S  17
/** PMS_LP_MM_HP_USBDEVICE_ALLOW : R/W; bitpos: [18]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP
 *  USB/Serial JTAG Controller.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_USBDEVICE_ALLOW    (BIT(18))
#define PMS_LP_MM_HP_USBDEVICE_ALLOW_M  (PMS_LP_MM_HP_USBDEVICE_ALLOW_V << PMS_LP_MM_HP_USBDEVICE_ALLOW_S)
#define PMS_LP_MM_HP_USBDEVICE_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_USBDEVICE_ALLOW_S  18
/** PMS_LP_MM_HP_LEDC_ALLOW : R/W; bitpos: [19]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP LEDC.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_LEDC_ALLOW    (BIT(19))
#define PMS_LP_MM_HP_LEDC_ALLOW_M  (PMS_LP_MM_HP_LEDC_ALLOW_V << PMS_LP_MM_HP_LEDC_ALLOW_S)
#define PMS_LP_MM_HP_LEDC_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_LEDC_ALLOW_S  19
/** PMS_LP_MM_HP_ETM_ALLOW : R/W; bitpos: [21]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP ETM.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_ETM_ALLOW    (BIT(21))
#define PMS_LP_MM_HP_ETM_ALLOW_M  (PMS_LP_MM_HP_ETM_ALLOW_V << PMS_LP_MM_HP_ETM_ALLOW_S)
#define PMS_LP_MM_HP_ETM_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_ETM_ALLOW_S  21
/** PMS_LP_MM_HP_INTRMTX_ALLOW : R/W; bitpos: [22]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP interrupt
 *  matrix.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_INTRMTX_ALLOW    (BIT(22))
#define PMS_LP_MM_HP_INTRMTX_ALLOW_M  (PMS_LP_MM_HP_INTRMTX_ALLOW_V << PMS_LP_MM_HP_INTRMTX_ALLOW_S)
#define PMS_LP_MM_HP_INTRMTX_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_INTRMTX_ALLOW_S  22
/** PMS_LP_MM_HP_TWAI0_ALLOW : R/W; bitpos: [23]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP TWAI0.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_TWAI0_ALLOW    (BIT(23))
#define PMS_LP_MM_HP_TWAI0_ALLOW_M  (PMS_LP_MM_HP_TWAI0_ALLOW_V << PMS_LP_MM_HP_TWAI0_ALLOW_S)
#define PMS_LP_MM_HP_TWAI0_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_TWAI0_ALLOW_S  23
/** PMS_LP_MM_HP_TWAI1_ALLOW : R/W; bitpos: [24]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP TWAI1.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_TWAI1_ALLOW    (BIT(24))
#define PMS_LP_MM_HP_TWAI1_ALLOW_M  (PMS_LP_MM_HP_TWAI1_ALLOW_V << PMS_LP_MM_HP_TWAI1_ALLOW_S)
#define PMS_LP_MM_HP_TWAI1_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_TWAI1_ALLOW_S  24
/** PMS_LP_MM_HP_TWAI2_ALLOW : R/W; bitpos: [25]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP TWAI2.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_TWAI2_ALLOW    (BIT(25))
#define PMS_LP_MM_HP_TWAI2_ALLOW_M  (PMS_LP_MM_HP_TWAI2_ALLOW_V << PMS_LP_MM_HP_TWAI2_ALLOW_S)
#define PMS_LP_MM_HP_TWAI2_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_TWAI2_ALLOW_S  25
/** PMS_LP_MM_HP_I3C_MST_ALLOW : R/W; bitpos: [26]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP I3C
 *  master controller.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_I3C_MST_ALLOW    (BIT(26))
#define PMS_LP_MM_HP_I3C_MST_ALLOW_M  (PMS_LP_MM_HP_I3C_MST_ALLOW_V << PMS_LP_MM_HP_I3C_MST_ALLOW_S)
#define PMS_LP_MM_HP_I3C_MST_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_I3C_MST_ALLOW_S  26
/** PMS_LP_MM_HP_I3C_SLV_ALLOW : R/W; bitpos: [27]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP I3C slave
 *  controller.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_I3C_SLV_ALLOW    (BIT(27))
#define PMS_LP_MM_HP_I3C_SLV_ALLOW_M  (PMS_LP_MM_HP_I3C_SLV_ALLOW_V << PMS_LP_MM_HP_I3C_SLV_ALLOW_S)
#define PMS_LP_MM_HP_I3C_SLV_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_I3C_SLV_ALLOW_S  27
/** PMS_LP_MM_HP_LCDCAM_ALLOW : R/W; bitpos: [28]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP LCD_CAM.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_LCDCAM_ALLOW    (BIT(28))
#define PMS_LP_MM_HP_LCDCAM_ALLOW_M  (PMS_LP_MM_HP_LCDCAM_ALLOW_V << PMS_LP_MM_HP_LCDCAM_ALLOW_S)
#define PMS_LP_MM_HP_LCDCAM_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_LCDCAM_ALLOW_S  28
/** PMS_LP_MM_HP_ADC_ALLOW : R/W; bitpos: [30]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP ADC.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_ADC_ALLOW    (BIT(30))
#define PMS_LP_MM_HP_ADC_ALLOW_M  (PMS_LP_MM_HP_ADC_ALLOW_V << PMS_LP_MM_HP_ADC_ALLOW_S)
#define PMS_LP_MM_HP_ADC_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_ADC_ALLOW_S  30
/** PMS_LP_MM_HP_UHCI_ALLOW : R/W; bitpos: [31]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP UHCI.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_UHCI_ALLOW    (BIT(31))
#define PMS_LP_MM_HP_UHCI_ALLOW_M  (PMS_LP_MM_HP_UHCI_ALLOW_V << PMS_LP_MM_HP_UHCI_ALLOW_S)
#define PMS_LP_MM_HP_UHCI_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_UHCI_ALLOW_S  31

