espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp2hp_peri_pms_reg.h
/** PMS_LP_MM_PMS_REG3_REG register
 *  Permission control register3 for the LP CPU in machine mode
 */
#define PMS_LP_MM_PMS_REG3_REG (DR_REG_LP2HP_PERI_PMS_BASE + 0x11c)
/** PMS_LP_MM_HP_GPIO_ALLOW : R/W; bitpos: [0]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP GPIO
 *  Matrix.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_GPIO_ALLOW    (BIT(0))
#define PMS_LP_MM_HP_GPIO_ALLOW_M  (PMS_LP_MM_HP_GPIO_ALLOW_V << PMS_LP_MM_HP_GPIO_ALLOW_S)
#define PMS_LP_MM_HP_GPIO_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_GPIO_ALLOW_S  0
/** PMS_LP_MM_HP_IOMUX_ALLOW : R/W; bitpos: [1]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP IO MUX.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_IOMUX_ALLOW    (BIT(1))
#define PMS_LP_MM_HP_IOMUX_ALLOW_M  (PMS_LP_MM_HP_IOMUX_ALLOW_V << PMS_LP_MM_HP_IOMUX_ALLOW_S)
#define PMS_LP_MM_HP_IOMUX_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_IOMUX_ALLOW_S  1
/** PMS_LP_MM_HP_SYSTIMER_ALLOW : R/W; bitpos: [2]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP system
 *  timer.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_SYSTIMER_ALLOW    (BIT(2))
#define PMS_LP_MM_HP_SYSTIMER_ALLOW_M  (PMS_LP_MM_HP_SYSTIMER_ALLOW_V << PMS_LP_MM_HP_SYSTIMER_ALLOW_S)
#define PMS_LP_MM_HP_SYSTIMER_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_SYSTIMER_ALLOW_S  2
/** PMS_LP_MM_HP_SYS_REG_ALLOW : R/W; bitpos: [3]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access HP system
 *  register.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_SYS_REG_ALLOW    (BIT(3))
#define PMS_LP_MM_HP_SYS_REG_ALLOW_M  (PMS_LP_MM_HP_SYS_REG_ALLOW_V << PMS_LP_MM_HP_SYS_REG_ALLOW_S)
#define PMS_LP_MM_HP_SYS_REG_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_SYS_REG_ALLOW_S  3
/** PMS_LP_MM_HP_CLKRST_ALLOW : R/W; bitpos: [4]; default: 1;
 *  Configures whether the LP CPU in machine mode has permission to access
 *  HP_SYS_CLKRST.
 *  0: Not allowed
 *  1: Allowed
 */
#define PMS_LP_MM_HP_CLKRST_ALLOW    (BIT(4))
#define PMS_LP_MM_HP_CLKRST_ALLOW_M  (PMS_LP_MM_HP_CLKRST_ALLOW_V << PMS_LP_MM_HP_CLKRST_ALLOW_S)
#define PMS_LP_MM_HP_CLKRST_ALLOW_V  0x00000001U
#define PMS_LP_MM_HP_CLKRST_ALLOW_S  4

#ifdef __cplusplus
}
#endif
